% 本函数是用来计算线性回归的函数
% 在具体实验中，主要是用来计算瞬时速度
% --- n 表示拟合时取的点对数量
% --- i 表示第i个点
% --- x 表示所有输入的x,x为列向量
% --- y 表示所有输入的y,y为列向量
% --- p 表示当前拟合的斜率
% --- b 表示当前拟合的截距
% --- pinv 表示求的是伪逆，可以在matlab帮助文件中查看

% =================== code ===================================
function [p,b]=Lfunc_linReg(n,i,x,y)

if i>=n
    X = [ones(n,1) [x(i-n+1:i)]];
    Y = y(i-n+1:i);
    beta = pinv(X'*X)*X'*Y;
    p = beta(2);
    b = beta(1);
else
    p = 0;
    b = 0;
end;
% ============================================================ 
